//========================================================================
#include "main_def_func.h" // Заголовочные файлы, глобальные определения, общие функции.
//========================================================================

//========================================================================
void main (void)
{
   wdt_enable (WDTO_15_MS);

   init_sys_timer ();

   __enable_interrupt ();

   Init_Events ();

   while (1)
   {
      __watchdog_reset ();

      service_timers ();

      drv_char_dsp ();

      tui_service ();

      Process_Events ();
   }
}
//========================================================================